Acquiring state lock. This may take a few moments...
module.lambda_layer.data.archive_file.pymysql_layer: Reading...
module.lambda_layer.data.archive_file.pymysql_layer: Read complete after 0s [id=fdbcd5e1107f297ea43bc9c2c8cf137dabe8d5aa]
module.iam.aws_iam_policy.lambda_vpc_access_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_vpc_access_policy]
module.iam.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_sql_initializer_policy]
module.iam.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_sql_initializer_role]
module.nat.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0f098aa6375787316]
module.iam.aws_iam_role.eks_cluster_role: Refreshing state... [id=EKSClusterRole]
module.lambda_layer.aws_lambda_layer_version.pymysql: Refreshing state... [id=arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:27]
module.iam.aws_iam_role.eks_node_role: Refreshing state... [id=EKSNodeInstanceRole]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-09ac4d6fa04e0c31e]
module.docker_images.data.aws_iam_role.lambda_exec_role: Reading...
module.docker_images.data.aws_db_instance.rds: Reading...
module.docker_images.data.aws_vpc.selected: Reading...
module.iam.aws_iam_role_policy_attachment.lambda_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250611074253332700000002]
module.iam.aws_iam_role_policy_attachment.lambda_vpc_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250611074253324500000001]
module.iam.aws_iam_role_policy_attachment.eks_cluster_attach: Refreshing state... [id=EKSClusterRole-20250611074253444500000006]
module.iam.aws_iam_role_policy_attachment.eks_cni: Refreshing state... [id=EKSNodeInstanceRole-20250611074253411700000005]
module.docker_images.data.aws_iam_role.lambda_exec_role: Read complete after 1s [id=lambda_sql_initializer_role]
module.iam.aws_iam_role_policy_attachment.ec2_container_registry_read_only: Refreshing state... [id=EKSNodeInstanceRole-20250611074253371800000004]
module.iam.aws_iam_role_policy_attachment.eks_worker_node: Refreshing state... [id=EKSNodeInstanceRole-20250611074253369000000003]
module.docker_images.data.aws_db_instance.rds: Read complete after 1s [id=news-rds]
module.docker_images.data.aws_vpc.selected: Read complete after 2s [id=vpc-09ac4d6fa04e0c31e]
module.docker_images.data.aws_security_group.rds_sg: Reading...
module.docker_images.data.aws_subnets.private: Reading...
module.igw.aws_internet_gateway.this: Refreshing state... [id=igw-0868a8fe91ce4b389]
module.subnet.aws_subnet.public_1a: Refreshing state... [id=subnet-023374856a363870c]
module.route.aws_route_table.private: Refreshing state... [id=rtb-03db2bdc812130d75]
module.security_group.aws_security_group.rds_sg: Refreshing state... [id=sg-0775cc5092a351bfd]
module.subnet.aws_subnet.public_2c: Refreshing state... [id=subnet-0111676438a56d028]
module.subnet.aws_subnet.private_4d: Refreshing state... [id=subnet-0acc46e0f7182ecf8]
module.route.aws_route_table.public: Refreshing state... [id=rtb-0d317795ccda885cb]
module.security_group.aws_security_group.app_sg: Refreshing state... [id=sg-00363f2014ded3e87]
module.docker_images.data.aws_security_group.rds_sg: Read complete after 0s [id=sg-0775cc5092a351bfd]
module.subnet.aws_subnet.private_3b: Refreshing state... [id=subnet-027d74aeb4801c5ed]
module.docker_images.data.aws_subnets.private: Read complete after 0s [id=ap-northeast-2]
module.nat.aws_nat_gateway.nat: Refreshing state... [id=nat-03e6c95e4a631370b]
module.route.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-05cc567f7ada267ef]
module.route.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-09c6c639b7692c1b9]
module.eks.aws_ecr_lifecycle_policy.spring_app: Refreshing state... [id=spring-app]
module.route.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-02e2eadc6e45ee2bc]
module.route.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-022cdd4590e0864d6]
module.eks.aws_eks_cluster.this: Refreshing state... [id=news-cluster]
module.route.aws_route.public_route: Refreshing state... [id=r-rtb-0d317795ccda885cb1080289494]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=news-rds]
module.route.aws_route.private_route: Refreshing state... [id=r-rtb-03db2bdc812130d751080289494]
module.eks.aws_eks_node_group.default: Refreshing state... [id=news-cluster:news-cluster-ng]
module.rds.aws_db_instance.this: Refreshing state... [id=db-AZXHRPS6ANTP3SHAVXUIUXEPIU]
module.sending_news.aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/news-lambda-handler]
module.sql_initializer.data.archive_file.lambda_zip: Reading...
module.sending_news.data.archive_file.lambda_zip: Reading...
module.sending_news.aws_cloudwatch_event_rule.weekday_hourly_trigger: Refreshing state... [id=send-news-lambda-weekday-trigger]
module.sending_news.data.archive_file.lambda_zip: Read complete after 0s [id=3bacbceb8770fe098e92cb837da1d197c6246a9d]
module.sql_initializer.data.archive_file.lambda_zip: Read complete after 0s [id=c105752a6395f83aa7883a789b1664b45fc19767]
module.sql_initializer.aws_lambda_function.sql_initializer: Refreshing state... [id=rds-sql-initializer]
module.sending_news.aws_lambda_function.this: Refreshing state... [id=news-lambda-handler]
module.sending_news.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.sending_news.aws_cloudwatch_event_target.lambda_target: Refreshing state... [id=send-news-lambda-weekday-trigger-send-news-lambda]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.docker_images.aws_cloudwatch_event_rule.lambda_schedule_rule will be created
  + resource "aws_cloudwatch_event_rule" "lambda_schedule_rule" {
      + arn                 = (known after apply)
      + description         = "Runs Lambda function on a schedule"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "news-crawler-schedule-rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 hour)"
      + tags                = {
          + "Name" = "news-crawler-schedule-rule"
        }
      + tags_all            = {
          + "Name" = "news-crawler-schedule-rule"
        }
    }

  # module.docker_images.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "news-crawler-schedule-rule"
      + target_id      = "lambda-news-crawler"
    }

  # module.docker_images.aws_lambda_function.news-crawler_mw will be created
  + resource "aws_lambda_function" "news-crawler_mw" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "news-crawler-lambda"
      + id                             = (known after apply)
      + image_uri                      = (sensitive value)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::635140758252:role/lambda_sql_initializer_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST"     = "news-rds.cb0ueo6m8a54.ap-northeast-2.rds.amazonaws.com"
              + "DB_NAME"     = "NewsSubscribe"
              + "DB_PASSWORD" = (sensitive value)
              + "DB_PORT"     = "3306"
              + "DB_USER"     = "root"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0775cc5092a351bfd",
            ]
          + subnet_ids                  = [
              + "subnet-027d74aeb4801c5ed",
              + "subnet-0acc46e0f7182ecf8",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # module.docker_images.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "news-crawler-lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "db_password" but a value
was found in file "terraform.auto.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

<!-- Sticky Pull Request Comment -->